No se puede subir/2023-1-grupo-46/app/controllers/compras_controller.rb

  def show
    @user = current_user
    @compra = Compra.find(params[:id])
---
SELECT "compras".* FROM "compras" WHERE "compras"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def new
    @libro = Libro.find(params[:libro_id])
---
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 526], ["LIMIT", 1]]

  def create
    @libro = Libro.find(params[:libro_id])
    @user = current_user
    @compra = @user.compras.new(estado: "E")
    @compra.libro = @libro
    if @compra.save
---
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 525], ["LIMIT", 1]]
INSERT INTO "compras" ("user_id", "libro_id", "estado", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 394], ["libro_id", 525], ["estado", "E"], ["created_at", "2023-06-13 16:01:10.677283"], ["updated_at", "2023-06-13 16:01:10.677283"]]

  def edit
    @user = current_user
    @compra = Compra.find(params[:id])
---
SELECT "compras".* FROM "compras" WHERE "compras"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]

  def update
    @user = current_user
    @compra = Compra.find(params[:id])
    if @compra.update(compra_params)
---
SELECT "compras".* FROM "compras" WHERE "compras"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "compras" SET "estado" = $1, "updated_at" = $2 WHERE "compras"."id" = $3  [["estado", "Updated Estado"], ["updated_at", "2023-05-22 15:55:35.934941"], ["id", 980190971]]

  def destroy
    @user = current_user
    @compra = @user.compras.find(params[:id])
    @compra.destroy
---
SELECT "compras".* FROM "compras" WHERE "compras"."user_id" = $1 AND "compras"."id" = $2 LIMIT $3  [["user_id", 132], ["id", 42], ["LIMIT", 1]]
DELETE FROM "compras" WHERE "compras"."id" = $1  [["id", 42]]