No se puede subir/2023-1-grupo-46/app/controllers/libros_controller.rb

INSERT INTO "libros" ("titulo", "fecha", "categoria", "autor", "precio", "stock", "descripcion", "created_at", "updated_at", "picture") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @libro = Libro.new(libro_params)
    if @libro.save

SELECT "libros".* FROM "libros"
---
  def index
    @libros = Libro.all

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 980190966], ["LIMIT", 1]]
SELECT "libros".* FROM "libros" WHERE "libros"."categoria" = $1 LIMIT $2  [["categoria", "Suspenso"], ["LIMIT", 6]]
---
  def show
    @libro = Libro.find(params[:id])
    @libros_categoria = Libro.where(categoria: @libro.categoria).limit(6)

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 348], ["LIMIT", 1]]
DELETE FROM "libros" WHERE "libros"."id" = $1  [["id", 348]]
---
  def destroy
    @libro = Libro.find(params[:id])
    @libro.destroy

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 311], ["LIMIT", 1]]
---
  def edit
    @libro = Libro.find(params[:id])

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 72], ["LIMIT", 1]]
UPDATE "libros" SET "titulo" = $1, "fecha" = $2, "categoria" = $3, "autor" = $4, "precio" = $5, "stock" = $6, "descripcion" = $7, "updated_at" = $8 WHERE "libros"."id" = $9  [["titulo", "C"], ["fecha", 2001], ["categoria", "Romance"], ["autor", "C"], ["precio", "1001"], ["stock", "2"], ["descripcion", "C"], ["updated_at", "2023-06-13 15:00:47.730710"], ["id", 76]]
---
  def update
    @libro = Libro.find(params[:id])
    if @libro.update(libro_params)

SELECT "libros".* FROM "libros" WHERE "libros"."categoria" = $1  [["categoria", "Suspenso"]]
---
  def categoria
    # Obtén el parámetro de categoría seleccionado
    @categoria_seleccionada = params[:categoria]
    # Aquí puedes realizar la lógica para buscar los libros según la categoría seleccionada
    @libros = Libro.where(categoria: @categoria_seleccionada)