No se puede subir/2023-1-grupo-46/app/controllers/mensajes_controller.rb

  def index
    @libro = Libro.find(params[:libro_id])
---
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 980190968], ["LIMIT", 1]]

  def show
    @libro = Libro.find(params[:libro_id])
    @mensaje = @libro.mensajes.find(params[:id])
---
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 980190981], ["LIMIT", 1]]
SELECT "mensajes".* FROM "mensajes" WHERE "mensajes"."libro_id" = $1 AND "mensajes"."id" = $2 LIMIT $3  [["libro_id", 980190981], ["id", 980190970], ["LIMIT", 1]]

  def new
    @libro = Libro.find(params[:libro_id])
---
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 980190970], ["LIMIT", 1]]

  def create
    @libro = Libro.find(params[:libro_id])
    @mensaje = @libro.mensajes.new(mensaje_params)
    @mensaje.user = current_user
    if @mensaje.save
---
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 147], ["LIMIT", 1]]
INSERT INTO "mensajes" ("texto", "user_id", "libro_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["texto", "aa"], ["user_id", 111], ["libro_id", 147], ["created_at", "2023-06-13 15:12:14.492801"], ["updated_at", "2023-06-13 15:12:14.492801"]]

  def edit
    @libro = Libro.find(params[:libro_id])
    @mensaje = @libro.mensajes.find(params[:id])
---
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 389], ["LIMIT", 1]]
SELECT "mensajes".* FROM "mensajes" WHERE "mensajes"."libro_id" = $1 AND "mensajes"."id" = $2 LIMIT $3  [["libro_id", 389], ["id", 87], ["LIMIT", 1]]

  def update
    @user = current_user
    @mensaje = @user.mensajes.find(params[:id])
    if @mensaje.update(mensaje_params)
---
SELECT "mensajes".* FROM "mensajes" WHERE "mensajes"."user_id" = $1 AND "mensajes"."id" = $2 LIMIT $3  [["user_id", 980191029], ["id", 980190989], ["LIMIT", 1]]
UPDATE "mensajes" SET "texto" = $1, "updated_at" = $2 WHERE "mensajes"."id" = $3  [["texto", "Updated Texto"], ["updated_at", "2023-05-22 15:40:51.538215"], ["id", 980190989]]

  def destroy
    @libro = Libro.find(params[:libro_id])
    @mensaje = @libro.mensajes.find(params[:id])
    @mensaje.destroy
---
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 362], ["LIMIT", 1]]
SELECT "mensajes".* FROM "mensajes" WHERE "mensajes"."libro_id" = $1 AND "mensajes"."id" = $2 LIMIT $3  [["libro_id", 362], ["id", 78], ["LIMIT", 1]]
DELETE FROM "mensajes" WHERE "mensajes"."id" = $1  [["id", 78]]