No se puede subir/2023-1-grupo-46/app/controllers/resenas_controller.rb

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 980191013], ["LIMIT", 1]]
---
  def index
    @libro = Libro.find(params[:libro_id])

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 980191015], ["LIMIT", 1]]
SELECT "resenas".* FROM "resenas" WHERE "resenas"."libro_id" = $1 AND "resenas"."id" = $2 LIMIT $3  [["libro_id", 980191015], ["id", 980190967], ["LIMIT", 1]]
---
  def show
    @user = current_user
    @libro = Libro.find(params[:libro_id])
    @resena = @libro.resenas.find(params[:id])

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 980191014], ["LIMIT", 1]]
---
  def new
    @libro = Libro.find(params[:libro_id])

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 115], ["LIMIT", 1]]
INSERT INTO "resenas" ("titulo", "cuerpo", "libro_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["titulo", "aa"], ["cuerpo", "bb"], ["libro_id", 115], ["user_id", 85], ["created_at", "2023-06-13 15:08:09.446882"], ["updated_at", "2023-06-13 15:08:09.446882"]]
---
  def create
    @libro = Libro.find(params[:libro_id])
    @resena = @libro.resenas.new(resena_params)
    @resena.user = current_user
    if @resena.save

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 416], ["LIMIT", 1]]
SELECT "resenas".* FROM "resenas" WHERE "resenas"."libro_id" = $1 AND "resenas"."id" = $2 LIMIT $3  [["libro_id", 416], ["id", 102], ["LIMIT", 1]]
---
  def edit
    @libro = Libro.find(params[:libro_id])
    @resena = @libro.resenas.find(params[:id])

SELECT "resenas".* FROM "resenas" WHERE "resenas"."user_id" = $1 AND "resenas"."id" = $2 LIMIT $3  [["user_id", 980191065], ["id", 980190982], ["LIMIT", 1]]
UPDATE "resenas" SET "titulo" = $1, "cuerpo" = $2, "updated_at" = $3 WHERE "resenas"."id" = $4  [["titulo", "Updated Titulo"], ["cuerpo", "Updated Cuerpo"], ["updated_at", "2023-05-22 15:47:16.735681"], ["id", 980190982]]
---
  def update
    @user = current_user
    @resena = @user.resenas.find(params[:id])
    if @resena.update(resena_params)

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 449], ["LIMIT", 1]]
SELECT "resenas".* FROM "resenas" WHERE "resenas"."libro_id" = $1 AND "resenas"."id" = $2 LIMIT $3  [["libro_id", 449], ["id", 111], ["LIMIT", 1]]
DELETE FROM "resenas" WHERE "resenas"."id" = $1  [["id", 111]]
---
  def destroy
    @libro = Libro.find(params[:libro_id])
    @resena = @libro.resenas.find(params[:id])
    @resena.destroy